#
# Для удобства проверки оба задания последовательно выполнены в этом файле.
#
# Цель заданий
# Научиться работать с print.

# Что нужно сделать:
# Зайдите в файлы с заданиями и исправте так чтобы вывод соответствовал условиям.
print('Задание 1.')
print()
# Исправьте программу так, чтобы в результате её
# выполнения на экран вывелась «доска».
# Пример:
# ----------
# |00000000|
# |00000000|
# |00000000|
# |00000000|
# ----------

print('----------')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('----------')

# Что нужно сделать:
# Зайдите в файлы с заданиями и исправте так чтобы вывод соответствовал условиям.
# Напишите программу, которая выводит такое «окно» на экран.

# Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

# Третий вариант
# ==============================
# ||                          ||
# ||                          ||
# ||          Привет,         ||
# ||          друг!           ||
# ||                          ||
# ||                          ||
# ==============================

# Размер окна может быть любым,
# вместо слова «друг» можете написать своё имя.
# Постарайтесь добиться результата из третьего варианта.
print()
print()
print('Задание 2.')
print()
print('Первый вариант')
print('==============================')
print('Привет')
print('студент')
print('==============================')
print()
print('Второй вариант')
print('==============================')
print('||        Привет            ||')
print('||        студент           ||')
print('==============================')
print()
print('Третий вариант')
print('==============================')
print('||                          ||')
print('||                          ||')
print('||          Привет,         ||')
print('||          студент!        ||')
print('||                          ||')
print('||                          ||')
print('==============================')
